.svn/pristine/62/6245d4c1ab7916e01c4ea923601395dd62c39ddf.svn-base

<?xml version="1.0" encoding="utf-8"?>
<wsdl:definitions xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:intf="http://ws.dgie.banxico.org.mx" xmlns:apachesoap="http://xml.apache.org/xml-soap" xmlns:wsdlsoap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:impl="http://ws.dgie.banxico.org.mx" targetNamespace="http://ws.dgie.banxico.org.mx" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/">
  <wsdl:types />
  <wsdl:message name="reservasInternacionalesBanxicoResponse">
    <wsdl:part name="result" type="xsd:string" />
  </wsdl:message>
  <wsdl:message name="reservasInternacionalesBanxicoRequest" />
  <wsdl:message name="tiposDeCambioBanxicoRequest" />
  <wsdl:message name="tasasDeInteresBanxicoRequest" />
  <wsdl:message name="udisBanxicoRequest" />
  <wsdl:message name="tiposDeCambioBanxicoResponse">
    <wsdl:part name="result" type="xsd:string" />
  </wsdl:message>
  <wsdl:message name="udisBanxicoResponse">
    <wsdl:part name="result" type="xsd:string" />
  </wsdl:message>
  <wsdl:message name="tasasDeInteresBanxicoResponse">
    <wsdl:part name="result" type="xsd:string" />
  </wsdl:message>
  <wsdl:portType name="DgieWSPort">
    <wsdl:operation name="reservasInternacionalesBanxico">
      <wsdl:input name="reservasInternacionalesBanxicoRequest" message="impl:reservasInternacionalesBanxicoRequest" />
      <wsdl:output name="reservasInternacionalesBanxicoResponse" message="impl:reservasInternacionalesBanxicoResponse" />
    </wsdl:operation>
    <wsdl:operation name="tasasDeInteresBanxico">
      <wsdl:input name="tasasDeInteresBanxicoRequest" message="impl:tasasDeInteresBanxicoRequest" />
      <wsdl:output name="tasasDeInteresBanxicoResponse" message="impl:tasasDeInteresBanxicoResponse" />
    </wsdl:operation>
    <wsdl:operation name="tiposDeCambioBanxico">
      <wsdl:input name="tiposDeCambioBanxicoRequest" message="impl:tiposDeCambioBanxicoRequest" />
      <wsdl:output name="tiposDeCambioBanxicoResponse" message="impl:tiposDeCambioBanxicoResponse" />
    </wsdl:operation>
    <wsdl:operation name="udisBanxico">
      <wsdl:input name="udisBanxicoRequest" message="impl:udisBanxicoRequest" />
      <wsdl:output name="udisBanxicoResponse" message="impl:udisBanxicoResponse" />
    </wsdl:operation>
  </wsdl:portType>
  <wsdl:binding name="DgieWSPortSoapBinding" type="impl:DgieWSPort">
    <wsdlsoap:binding transport="http://schemas.xmlsoap.org/soap/http" style="rpc" />
    <wsdl:operation name="reservasInternacionalesBanxico">
      <wsdlsoap:operation soapAction="" />
      <wsdl:input name="reservasInternacionalesBanxicoRequest">
        <wsdlsoap:body use="encoded" namespace="http://ws.dgie.banxico.org.mx" encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" />
      </wsdl:input>
      <wsdl:output name="reservasInternacionalesBanxicoResponse">
        <wsdlsoap:body use="encoded" namespace="http://ws.dgie.banxico.org.mx" encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" />
      </wsdl:output>
    </wsdl:operation>
    <wsdl:operation name="tasasDeInteresBanxico">
      <wsdlsoap:operation soapAction="" />
      <wsdl:input name="tasasDeInteresBanxicoRequest">
        <wsdlsoap:body use="encoded" namespace="http://ws.dgie.banxico.org.mx" encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" />
      </wsdl:input>
      <wsdl:output name="tasasDeInteresBanxicoResponse">
        <wsdlsoap:body use="encoded" namespace="http://ws.dgie.banxico.org.mx" encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" />
      </wsdl:output>
    </wsdl:operation>
    <wsdl:operation name="tiposDeCambioBanxico">
      <wsdlsoap:operation soapAction="" />
      <wsdl:input name="tiposDeCambioBanxicoRequest">
        <wsdlsoap:body use="encoded" namespace="http://ws.dgie.banxico.org.mx" encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" />
      </wsdl:input>
      <wsdl:output name="tiposDeCambioBanxicoResponse">
        <wsdlsoap:body use="encoded" namespace="http://ws.dgie.banxico.org.mx" encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" />
      </wsdl:output>
    </wsdl:operation>
    <wsdl:operation name="udisBanxico">
      <wsdlsoap:operation soapAction="" />
      <wsdl:input name="udisBanxicoRequest">
        <wsdlsoap:body use="encoded" namespace="http://ws.dgie.banxico.org.mx" encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" />
      </wsdl:input>
      <wsdl:output name="udisBanxicoResponse">
        <wsdlsoap:body use="encoded" namespace="http://ws.dgie.banxico.org.mx" encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" />
      </wsdl:output>
    </wsdl:operation>
  </wsdl:binding>
  <wsdl:service name="DgieWS">
    <wsdl:port name="DgieWSPort" binding="impl:DgieWSPortSoapBinding">
      <wsdlsoap:address location="http://www.banxico.org.mx/DgieWSWeb/DgieWS" />
    </wsdl:port>
  </wsdl:service>
</wsdl:definitions>